app/controllers/authentication_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ajays871@gmail.com' LIMIT 1
---
	def login
		resource = User.find_by(:email => params[:user][:email])