app/views/api/yilli/languages/index.json.jbuilder

SELECT COUNT(*) FROM `bookings` WHERE `bookings`.`language_id` = '1'
---
    json.continent language.continent
    json.teachings language.bookings.count